Revit 2027 API
RebarBendData.TerminationOrientation1 Property
 Identifies the orientation of the termination (e.g. hook, crank) at the end. The default value is RebarTerminationOrientation::Left.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarTerminationOrientation TerminationOrientation1 { get; set; }
Public Property TerminationOrientation1 As RebarTerminationOrientation
	Get
	Set
public:
property RebarTerminationOrientation TerminationOrientation1 {
	RebarTerminationOrientation get ();
	void set (RebarTerminationOrientation value);
}
member TerminationOrientation1 : RebarTerminationOrientation with get, set
Property Value
RebarTerminationOrientation
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace